/* Задача за самостоятелна работа
   Да се напише програма, която инициализира целочислен масив и,
каквато и да е инициализацията, извежда масива, пренарежда го така,
че всяко четно число да бъде преди (с по-малък индекс)
от всяко нечетно число, и пак го извежда.
   Наредбата на числата с еднаква четност помежду им няма значение.
*/
#include <iostream>
using namespace std;
int main(){
  long ar[] = { 1, 2, 3, 4, 5, 6, 7, -1, -2, -3, -4, -5, -6, -7 };
  const short len = sizeof(ar) / sizeof(ar[0]);
  for (short i = 0; i < len; ++i) cout << ar[i] << " ";
  cout << "\n\n";
  for (short L = 0, R = len - 1; L < R; ++L, --R) {
    while (L < R && ar[L] % 2 == 0) ++L; // прескачат се четните
    while (L < R && ar[R] % 2) --R; // прескачат се нечетните
    long temp = ar[L];
    ar[L] = ar[R];
    ar[R] = temp;
  }
  for (short i = 0; i < len; ++i) cout << ar[i] << " ";
  cout << "\n\n";

  system("pause");
  return 0;
}