/* Задача
   Да се инициализира и изведе масив от повече
от 8 цели числа от тип long. 
   Да се изведат всички тройки последователно
разположени елементи на масива, в които първият
и третият елемент са с еднаква четност.

   Пример за извеждан от програмата текст:
2  9  4  6  8  7  4  3  5  11  
3 <- 5 -> 11
7 <- 4 -> 3
8 <- 7 -> 4
4 <- 6 -> 8
2 <- 9 -> 4   
*/
// Примерно решение
#include <iostream>
using namespace std;
#include <cmath>
int main() {
  long ar[]={2,9,4,6,8,7,4,3,5,11};
  short const len=sizeof(ar)/sizeof(ar[0]); // (добавено от мен) намираме броя елементи на масива като делим цялата дължина памет, заемана от масива на дължината памет на един елемент от масива
  for (short i = 0; i < len; ++i)
  {
	  cout << ar[i] << "  ";
  }
  cout<<endl;

  for (short i = len - 2; 0 < i; --i)
  {
	  if (abs(ar[i - 1] % 2) == abs(ar[i + 1] % 2))
	  {
		  cout << ar[i - 1] << " <- " << ar[i] << " -> " << ar[i + 1] << endl;
	  }
  }

  // (добавено от мен) всеки елемент от масива има еднакъв тип, т.е. заема еднаква дължина памет

  system("pause");
  return 0;
}
